zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpgpio_reg.h
#define LPGPIO_MODE_MODE_Pos            (0)                                         /*!< LPGPIO_T::MODE: MODE Position              */
#define LPGPIO_MODE_MODE_Msk            (0xfful << LPGPIO_MODE_MODE_Pos)            /*!< LPGPIO_T::MODE: MODE Mask                  */

#define LPGPIO_MODE_MODE0_Pos           (0)                                         /*!< LPGPIO_T::MODE: MODE0 Position             */
#define LPGPIO_MODE_MODE0_Msk           (0x1ul << LPGPIO_MODE_MODE0_Pos)            /*!< LPGPIO_T::MODE: MODE0 Mask                 */

#define LPGPIO_MODE_MODE1_Pos           (1)                                         /*!< LPGPIO_T::MODE: MODE1 Position             */
#define LPGPIO_MODE_MODE1_Msk           (0x1ul << LPGPIO_MODE_MODE1_Pos)            /*!< LPGPIO_T::MODE: MODE1 Mask                 */

#define LPGPIO_MODE_MODE2_Pos           (2)                                         /*!< LPGPIO_T::MODE: MODE2 Position             */
#define LPGPIO_MODE_MODE2_Msk           (0x1ul << LPGPIO_MODE_MODE2_Pos)            /*!< LPGPIO_T::MODE: MODE2 Mask                 */

#define LPGPIO_MODE_MODE3_Pos           (3)                                         /*!< LPGPIO_T::MODE: MODE3 Position             */
#define LPGPIO_MODE_MODE3_Msk           (0x1ul << LPGPIO_MODE_MODE3_Pos)            /*!< LPGPIO_T::MODE: MODE3 Mask                 */

#define LPGPIO_MODE_MODE4_Pos           (4)                                         /*!< LPGPIO_T::MODE: MODE4 Position             */
#define LPGPIO_MODE_MODE4_Msk           (0x1ul << LPGPIO_MODE_MODE4_Pos)            /*!< LPGPIO_T::MODE: MODE4 Mask                 */

#define LPGPIO_MODE_MODE5_Pos           (5)                                         /*!< LPGPIO_T::MODE: MODE5 Position             */
#define LPGPIO_MODE_MODE5_Msk           (0x1ul << LPGPIO_MODE_MODE5_Pos)            /*!< LPGPIO_T::MODE: MODE5 Mask                 */

#define LPGPIO_MODE_MODE6_Pos           (6)                                         /*!< LPGPIO_T::MODE: MODE6 Position             */
#define LPGPIO_MODE_MODE6_Msk           (0x1ul << LPGPIO_MODE_MODE6_Pos)            /*!< LPGPIO_T::MODE: MODE6 Mask                 */

#define LPGPIO_MODE_MODE7_Pos           (7)                                         /*!< LPGPIO_T::MODE: MODE7 Position             */
#define LPGPIO_MODE_MODE7_Msk           (0x1ul << LPGPIO_MODE_MODE7_Pos)            /*!< LPGPIO_T::MODE: MODE7 Mask                 */

#define LPGPIO_MODE_LPPDMA_EN_Pos       (31)                                        /*!< LPGPIO_T::MODE: LPPDMA_EN Position         */
#define LPGPIO_MODE_LPPDMA_EN_Msk       (0x1ul << LPGPIO_MODE_LPPDMA_EN_Pos)        /*!< LPGPIO_T::MODE: LPPDMA_EN Mask             */

#define LPGPIO_DOUT_DOUT_Pos            (0)                                         /*!< LPGPIO_T::DOUT: DOUT Position              */
#define LPGPIO_DOUT_DOUT_Msk            (0xfful << LPGPIO_DOUT_DOUT_Pos)            /*!< LPGPIO_T::DOUT: DOUT Mask                  */

#define LPGPIO_DOUT_DOUT0_Pos           (0)                                         /*!< LPGPIO_T::DOUT: DOUT0 Position             */
#define LPGPIO_DOUT_DOUT0_Msk           (0x1ul << LPGPIO_DOUT_DOUT0_Pos)            /*!< LPGPIO_T::DOUT: DOUT0 Mask                 */

#define LPGPIO_DOUT_DOUT1_Pos           (1)                                         /*!< LPGPIO_T::DOUT: DOUT1 Position             */
#define LPGPIO_DOUT_DOUT1_Msk           (0x1ul << LPGPIO_DOUT_DOUT1_Pos)            /*!< LPGPIO_T::DOUT: DOUT1 Mask                 */

#define LPGPIO_DOUT_DOUT2_Pos           (2)                                         /*!< LPGPIO_T::DOUT: DOUT2 Position             */
#define LPGPIO_DOUT_DOUT2_Msk           (0x1ul << LPGPIO_DOUT_DOUT2_Pos)            /*!< LPGPIO_T::DOUT: DOUT2 Mask                 */

#define LPGPIO_DOUT_DOUT3_Pos           (3)                                         /*!< LPGPIO_T::DOUT: DOUT3 Position             */
#define LPGPIO_DOUT_DOUT3_Msk           (0x1ul << LPGPIO_DOUT_DOUT3_Pos)            /*!< LPGPIO_T::DOUT: DOUT3 Mask                 */

#define LPGPIO_DOUT_DOUT4_Pos           (4)                                         /*!< LPGPIO_T::DOUT: DOUT4 Position             */
#define LPGPIO_DOUT_DOUT4_Msk           (0x1ul << LPGPIO_DOUT_DOUT4_Pos)            /*!< LPGPIO_T::DOUT: DOUT4 Mask                 */

#define LPGPIO_DOUT_DOUT5_Pos           (5)                                         /*!< LPGPIO_T::DOUT: DOUT5 Position             */
#define LPGPIO_DOUT_DOUT5_Msk           (0x1ul << LPGPIO_DOUT_DOUT5_Pos)            /*!< LPGPIO_T::DOUT: DOUT5 Mask                 */

#define LPGPIO_DOUT_DOUT6_Pos           (6)                                         /*!< LPGPIO_T::DOUT: DOUT6 Position             */
#define LPGPIO_DOUT_DOUT6_Msk           (0x1ul << LPGPIO_DOUT_DOUT6_Pos)            /*!< LPGPIO_T::DOUT: DOUT6 Mask                 */

#define LPGPIO_DOUT_DOUT7_Pos           (7)                                         /*!< LPGPIO_T::DOUT: DOUT7 Position             */
#define LPGPIO_DOUT_DOUT7_Msk           (0x1ul << LPGPIO_DOUT_DOUT7_Pos)            /*!< LPGPIO_T::DOUT: DOUT7 Mask                 */

#define LPGPIO_PIN_PIN_Pos              (0)                                         /*!< LPGPIO_T::PIN: PIN Position                */
#define LPGPIO_PIN_PIN_Msk              (0xfful << LPGPIO_PIN_PIN_Pos)              /*!< LPGPIO_T::PIN: PIN Mask                    */

#define LPGPIO_PIN_PIN0_Pos             (0)                                         /*!< LPGPIO_T::PIN: PIN0 Position               */
#define LPGPIO_PIN_PIN0_Msk             (0x1ul << LPGPIO_PIN_PIN0_Pos)              /*!< LPGPIO_T::PIN: PIN0 Mask                   */

#define LPGPIO_PIN_PIN1_Pos             (1)                                         /*!< LPGPIO_T::PIN: PIN1 Position               */
#define LPGPIO_PIN_PIN1_Msk             (0x1ul << LPGPIO_PIN_PIN1_Pos)              /*!< LPGPIO_T::PIN: PIN1 Mask                   */

#define LPGPIO_PIN_PIN2_Pos             (2)                                         /*!< LPGPIO_T::PIN: PIN2 Position               */
#define LPGPIO_PIN_PIN2_Msk             (0x1ul << LPGPIO_PIN_PIN2_Pos)              /*!< LPGPIO_T::PIN: PIN2 Mask                   */

#define LPGPIO_PIN_PIN3_Pos             (3)                                         /*!< LPGPIO_T::PIN: PIN3 Position               */
#define LPGPIO_PIN_PIN3_Msk             (0x1ul << LPGPIO_PIN_PIN3_Pos)              /*!< LPGPIO_T::PIN: PIN3 Mask                   */

