zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpgpio_reg.h
#define LPGPIO_PIN_PIN4_Pos             (4)                                         /*!< LPGPIO_T::PIN: PIN4 Position               */
#define LPGPIO_PIN_PIN4_Msk             (0x1ul << LPGPIO_PIN_PIN4_Pos)              /*!< LPGPIO_T::PIN: PIN4 Mask                   */

#define LPGPIO_PIN_PIN5_Pos             (5)                                         /*!< LPGPIO_T::PIN: PIN5 Position               */
#define LPGPIO_PIN_PIN5_Msk             (0x1ul << LPGPIO_PIN_PIN5_Pos)              /*!< LPGPIO_T::PIN: PIN5 Mask                   */

#define LPGPIO_PIN_PIN6_Pos             (6)                                         /*!< LPGPIO_T::PIN: PIN6 Position               */
#define LPGPIO_PIN_PIN6_Msk             (0x1ul << LPGPIO_PIN_PIN6_Pos)              /*!< LPGPIO_T::PIN: PIN6 Mask                   */

#define LPGPIO_PIN_PIN7_Pos             (7)                                         /*!< LPGPIO_T::PIN: PIN7 Position               */
#define LPGPIO_PIN_PIN7_Msk             (0x1ul << LPGPIO_PIN_PIN7_Pos)              /*!< LPGPIO_T::PIN: PIN7 Mask                   */

#define LPGPIO_DSRST_DSET_Pos           (0)                                         /*!< LPGPIO_T::DSRST: DSET Position             */
#define LPGPIO_DSRST_DSET_Msk           (0xfful << LPGPIO_DSRST_DSET_Pos)           /*!< LPGPIO_T::DSRST: DSET Mask                 */

#define LPGPIO_DSRST_DSET0_Pos          (0)                                         /*!< LPGPIO_T::DSRST: DSET0 Position            */
#define LPGPIO_DSRST_DSET0_Msk          (0x1ul << LPGPIO_DSRST_DSET0_Pos)           /*!< LPGPIO_T::DSRST: DSET0 Mask                */

#define LPGPIO_DSRST_DSET1_Pos          (1)                                         /*!< LPGPIO_T::DSRST: DSET1 Position            */
#define LPGPIO_DSRST_DSET1_Msk          (0x1ul << LPGPIO_DSRST_DSET1_Pos)           /*!< LPGPIO_T::DSRST: DSET1 Mask                */

#define LPGPIO_DSRST_DSET2_Pos          (2)                                         /*!< LPGPIO_T::DSRST: DSET2 Position            */
#define LPGPIO_DSRST_DSET2_Msk          (0x1ul << LPGPIO_DSRST_DSET2_Pos)           /*!< LPGPIO_T::DSRST: DSET2 Mask                */

#define LPGPIO_DSRST_DSET3_Pos          (3)                                         /*!< LPGPIO_T::DSRST: DSET3 Position            */
#define LPGPIO_DSRST_DSET3_Msk          (0x1ul << LPGPIO_DSRST_DSET3_Pos)           /*!< LPGPIO_T::DSRST: DSET3 Mask                */

#define LPGPIO_DSRST_DSET4_Pos          (4)                                         /*!< LPGPIO_T::DSRST: DSET4 Position            */
#define LPGPIO_DSRST_DSET4_Msk          (0x1ul << LPGPIO_DSRST_DSET4_Pos)           /*!< LPGPIO_T::DSRST: DSET4 Mask                */

#define LPGPIO_DSRST_DSET5_Pos          (5)                                         /*!< LPGPIO_T::DSRST: DSET5 Position            */
#define LPGPIO_DSRST_DSET5_Msk          (0x1ul << LPGPIO_DSRST_DSET5_Pos)           /*!< LPGPIO_T::DSRST: DSET5 Mask                */

#define LPGPIO_DSRST_DSET6_Pos          (6)                                         /*!< LPGPIO_T::DSRST: DSET6 Position            */
#define LPGPIO_DSRST_DSET6_Msk          (0x1ul << LPGPIO_DSRST_DSET6_Pos)           /*!< LPGPIO_T::DSRST: DSET6 Mask                */

#define LPGPIO_DSRST_DSET7_Pos          (7)                                         /*!< LPGPIO_T::DSRST: DSET7 Position            */
#define LPGPIO_DSRST_DSET7_Msk          (0x1ul << LPGPIO_DSRST_DSET7_Pos)           /*!< LPGPIO_T::DSRST: DSET7 Mask                */

#define LPGPIO_DSRST_DRESET_Pos         (16)                                        /*!< LPGPIO_T::DSRST: DRESET Position           */
#define LPGPIO_DSRST_DRESET_Msk         (0xfful << LPGPIO_DSRST_DRESET_Pos)         /*!< LPGPIO_T::DSRST: DRESET Mask               */

#define LPGPIO_DSRST_DRESET0_Pos        (16)                                        /*!< LPGPIO_T::DSRST: DRESET0 Position          */
#define LPGPIO_DSRST_DRESET0_Msk        (0x1ul << LPGPIO_DSRST_DRESET0_Pos)         /*!< LPGPIO_T::DSRST: DRESET0 Mask              */

#define LPGPIO_DSRST_DRESET1_Pos        (17)                                        /*!< LPGPIO_T::DSRST: DRESET1 Position          */
#define LPGPIO_DSRST_DRESET1_Msk        (0x1ul << LPGPIO_DSRST_DRESET1_Pos)         /*!< LPGPIO_T::DSRST: DRESET1 Mask              */

#define LPGPIO_DSRST_DRESET2_Pos        (18)                                        /*!< LPGPIO_T::DSRST: DRESET2 Position          */
#define LPGPIO_DSRST_DRESET2_Msk        (0x1ul << LPGPIO_DSRST_DRESET2_Pos)         /*!< LPGPIO_T::DSRST: DRESET2 Mask              */

#define LPGPIO_DSRST_DRESET3_Pos        (19)                                        /*!< LPGPIO_T::DSRST: DRESET3 Position          */
#define LPGPIO_DSRST_DRESET3_Msk        (0x1ul << LPGPIO_DSRST_DRESET3_Pos)         /*!< LPGPIO_T::DSRST: DRESET3 Mask              */

#define LPGPIO_DSRST_DRESET4_Pos        (20)                                        /*!< LPGPIO_T::DSRST: DRESET4 Position          */
#define LPGPIO_DSRST_DRESET4_Msk        (0x1ul << LPGPIO_DSRST_DRESET4_Pos)         /*!< LPGPIO_T::DSRST: DRESET4 Mask              */

#define LPGPIO_DSRST_DRESET5_Pos        (21)                                        /*!< LPGPIO_T::DSRST: DRESET5 Position          */
#define LPGPIO_DSRST_DRESET5_Msk        (0x1ul << LPGPIO_DSRST_DRESET5_Pos)         /*!< LPGPIO_T::DSRST: DRESET5 Mask              */

#define LPGPIO_DSRST_DRESET6_Pos        (22)                                        /*!< LPGPIO_T::DSRST: DRESET6 Position          */
#define LPGPIO_DSRST_DRESET6_Msk        (0x1ul << LPGPIO_DSRST_DRESET6_Pos)         /*!< LPGPIO_T::DSRST: DRESET6 Mask              */

#define LPGPIO_DSRST_DRESET7_Pos        (23)                                        /*!< LPGPIO_T::DSRST: DRESET7 Position          */
#define LPGPIO_DSRST_DRESET7_Msk        (0x1ul << LPGPIO_DSRST_DRESET7_Pos)         /*!< LPGPIO_T::DSRST: DRESET7 Mask              */

#define LPGPIO_DRST_DRESET_Pos          (0)                                         /*!< LPGPIO_T::DRST: DRESET Position            */
#define LPGPIO_DRST_DRESET_Msk          (0xfful << LPGPIO_DRST_DRESET_Pos)          /*!< LPGPIO_T::DRST: DRESET Mask                */

#define LPGPIO_DRST_DRESET0_Pos         (0)                                         /*!< LPGPIO_T::DRST: DRESET0 Position           */
#define LPGPIO_DRST_DRESET0_Msk         (0x1ul << LPGPIO_DRST_DRESET0_Pos)          /*!< LPGPIO_T::DRST: DRESET0 Mask               */

#define LPGPIO_DRST_DRESET1_Pos         (1)                                         /*!< LPGPIO_T::DRST: DRESET1 Position           */
#define LPGPIO_DRST_DRESET1_Msk         (0x1ul << LPGPIO_DRST_DRESET1_Pos)          /*!< LPGPIO_T::DRST: DRESET1 Mask               */

