zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpgpio_reg.h
#define LPGPIO_DRST_DRESET2_Pos         (2)                                         /*!< LPGPIO_T::DRST: DRESET2 Position           */
#define LPGPIO_DRST_DRESET2_Msk         (0x1ul << LPGPIO_DRST_DRESET2_Pos)          /*!< LPGPIO_T::DRST: DRESET2 Mask               */

#define LPGPIO_DRST_DRESET3_Pos         (3)                                         /*!< LPGPIO_T::DRST: DRESET3 Position           */
#define LPGPIO_DRST_DRESET3_Msk         (0x1ul << LPGPIO_DRST_DRESET3_Pos)          /*!< LPGPIO_T::DRST: DRESET3 Mask               */

#define LPGPIO_DRST_DRESET4_Pos         (4)                                         /*!< LPGPIO_T::DRST: DRESET4 Position           */
#define LPGPIO_DRST_DRESET4_Msk         (0x1ul << LPGPIO_DRST_DRESET4_Pos)          /*!< LPGPIO_T::DRST: DRESET4 Mask               */

#define LPGPIO_DRST_DRESET5_Pos         (5)                                         /*!< LPGPIO_T::DRST: DRESET5 Position           */
#define LPGPIO_DRST_DRESET5_Msk         (0x1ul << LPGPIO_DRST_DRESET5_Pos)          /*!< LPGPIO_T::DRST: DRESET5 Mask               */

#define LPGPIO_DRST_DRESET6_Pos         (6)                                         /*!< LPGPIO_T::DRST: DRESET6 Position           */
#define LPGPIO_DRST_DRESET6_Msk         (0x1ul << LPGPIO_DRST_DRESET6_Pos)          /*!< LPGPIO_T::DRST: DRESET6 Mask               */

#define LPGPIO_DRST_DRESET7_Pos         (7)                                         /*!< LPGPIO_T::DRST: DRESET7 Position           */
#define LPGPIO_DRST_DRESET7_Msk         (0x1ul << LPGPIO_DRST_DRESET7_Pos)          /*!< LPGPIO_T::DRST: DRESET7 Mask               */

/** @} LPGPIO_CONST */
/** @} end of LPGPIO register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __LPGPIO_REG_H__ */
